void main() {
  // var: keyword تقوم بتحديد ال datatype بناء علي القيمه اللي هتدخل للمتغير ولكن يجب وضع قيمه للمتغير في نفس ال statment

  // daynamic:weak datatype نستخدها لما نكون مش عارفين نوع المتغير لانها بتقبل اي قيمه ولكن لا يمكنها الاحتفاظ بنوع القيمه

  // int: datatype تستخدم لتعريف الارقام الصحيحه

  // double: datatype تستخدم لتعريف الارقام العشرية

  // num: datatype تستخدم لتعريف جميع الارقام

  // String: datatype تستخدم لتعريف النصوص

  // bool: datatype تستخدم للاجابه علي سؤال صح او غلط
}
